{"id":"2","gender_ur":"مردانہ","islamic_reference_en":"The word 'Ghulam' (غلام) appears in the Quran in various contexts, often referring to a young boy or servant. For instance, in Surah Al-Kahf (18:82) and Surah Yusuf (12:19), it refers to a youth or a boy. Historically, it signifies devotion and humility, often used in compound names like Ghulamullah (Servant of Allah) or Ghulam Muhammad (Servant of Muhammad).","gender_en":"Male","origin_en":"Arabic, Persian, Urdu","related_names_en":"Ghulamullah, Ghulam Rasool, Ghulam Abbas","related_names_ur":"غلام اللہ، غلام رسول، غلام عباس","is_quranic_ur":"ہاں","description_ur":"غلام ایک معروف عربی، فارسی اور اردو مردانہ نام ہے جس کا مطلب 'غلام'، 'خادم'، 'لڑکا' یا 'نوجوان' ہے۔ اسلامی ثقافت میں، یہ اکثر مرکب ناموں میں اللہ یا کسی قابل احترام شخصیت کے لیے عقیدت اور عاجزی کا اظہار کرنے کے لیے استعمال ہوتا ہے، جیسے غلام اللہ (اللہ کا بندہ) یا غلام محمد (محمد کا بندہ)۔ اس کے لفظی معنی کے باوجود، یہ الہی یا انبیاء کی بندگی کی گہری روحانی اہمیت رکھتا ہے، جو مکمل اطاعت اور لگن کی علامت ہے۔","pronunciation_en":"Ghoo-laam","description_en":"Ghulam is a prominent Arabic, Persian, and Urdu male name meaning 'slave', 'servant', 'youth', or 'boy'. In Islamic culture, it is often used in compound names to express devotion and humility towards Allah or a revered personality, such as Ghulamullah (Servant of Allah) or Ghulam Muhammad (Servant of Muhammad). Despite its literal meaning, it carries a profound spiritual connotation of servitude to the Divine or the Prophets, symbolizing complete submission and dedication.","meaning_ur":"غلام، خادم، لڑکا، نوجوان","islamic_reference_ur":"لفظ 'غلام' قرآن میں مختلف سیاق و سباق میں آیا ہے، جو اکثر ایک نوجوان لڑکے یا خادم کے لیے استعمال ہوتا ہے۔ مثال کے طور پر، سورہ کہف (18:82) اور سورہ یوسف (12:19) میں یہ نوجوان یا لڑکے کے لیے استعمال ہوا ہے۔ تاریخی طور پر، یہ عقیدت اور عاجزی کی علامت ہے، اور اکثر مرکب ناموں میں استعمال ہوتا ہے جیسے غلام اللہ (اللہ کا بندہ) یا غلام محمد (محمد کا بندہ)۔","meaning_en":"Slave, Servant, Youth, Boy","name_en":"Ghulam","origin_ur":"عربی، فارسی، اردو","is_quranic_en":"Yes","name_ur":"غلام","pronunciation_ur":"غُلام"}
